# Pandas

https://pandas.pydata.org

Pandas is the excel version of Python

* Intro
* Series
* Data Frame
* Handling of Missing Data
* GroupBy
* Merging, Joining, and Concatenating
* Operations, Indexing, Slicing of dataframes
* Data input and output
    - Creating dataframes by:
        - Reading files (csv, excel etc.)
        - Reading Databases
        - Reading HTML

## Series


First main data type in pandas is Series. Series is like a numpy array with certain differences:

* Series can contain multiple data types
* Series can be indexed by a label and not just by a numeric index

In [1]:
import numpy as np
import pandas as pd

### Creating a series

Series can be created by using:
* List
* Numpy Array
* Dictionary

In [2]:
label = ['a','b','c']
my_list = [1,2,3]
arr = np.array([10,20,30])
d = {'a':100,'b':200,'c':300}

In [3]:
# Creating series using list
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(data=my_list,index=label)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(d)

a    100
b    200
c    300
dtype: int64

### Data in series

In [6]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to use pandas series is understanding its index. Just like hashtable/dictionary, pandas
refers to series data with names / indices.

In [40]:
ser1 = pd.Series([1,2,3,4],index='USA Germany USSR Japan'.split())
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [41]:
ser2 = pd.Series([1,2,5,4],index='USA Germany Italy Japan'.split())
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [42]:
ser1['USA']

1

### Operations on Series

In [43]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Dataframes

Dataframes are the workhorse of pandas, clearly inspired by R. We've dataframe in Spark as well.

Dataframe is nothing but two or more series having same indices put together.

In [44]:
import pandas as pd
import numpy as np

In [45]:
df = pd.DataFrame(np.random.randn(5,4),index = 'A B C D E'.split())

In [46]:
df

          0         1         2         3
A -0.194121  0.221463 -0.892352  0.078906
B -1.627986  0.244806 -0.640485  0.618630
C -0.718027 -0.173697 -0.101172 -1.610044
D -1.354671  0.725389 -0.568856 -1.071165
E -1.017268  0.004343  3.091350  0.865468

### Selection and Indexing in Dataframe

In [47]:
df = pd.DataFrame(np.random.randn(5,4),index = 'A B C D E'.split(),columns='sum X Y Z'.split())

In [48]:
df

        sum         X         Y         Z
A  0.956184 -0.802699  0.483191  0.659958
B  0.786484  0.472433 -1.947466  0.313630
C -0.248642  1.101180  0.346708 -0.168046
D  0.058704 -0.808790 -0.222812  0.261050
E -0.271067 -1.721195  0.299051 -1.435579

In [49]:
df['sum']

A    0.956184
B    0.786484
C   -0.248642
D    0.058704
E   -0.271067
Name: sum, dtype: float64

In [50]:
df.sum # Not Recommended - SQL Syntax

<bound method DataFrame.sum of         sum         X         Y         Z
A  0.956184 -0.802699  0.483191  0.659958
B  0.786484  0.472433 -1.947466  0.313630
C -0.248642  1.101180  0.346708 -0.168046
D  0.058704 -0.808790 -0.222812  0.261050
E -0.271067 -1.721195  0.299051 -1.435579>

In [51]:
df = pd.DataFrame(np.random.randn(5,4),index = 'A B C D E'.split(),columns='W X Y Z'.split())

In [52]:
type(df['W'])

pandas.core.series.Series

In [53]:
df

          W         X         Y         Z
A -0.385759  0.058497  1.615827  0.277606
B  1.064094 -0.926511  0.643883  0.841569
C  0.949747  0.311666  1.140044  0.417133
D  0.060274  0.457144 -0.680493 -2.104358
E -1.151623 -1.158658 -0.161199 -0.571738

### Create new columns in a dataframe

In [54]:
df['new'] = df['W'] + df['X']

In [55]:
df

          W         X         Y         Z       new
A -0.385759  0.058497  1.615827  0.277606 -0.327261
B  1.064094 -0.926511  0.643883  0.841569  0.137583
C  0.949747  0.311666  1.140044  0.417133  1.261413
D  0.060274  0.457144 -0.680493 -2.104358  0.517419
E -1.151623 -1.158658 -0.161199 -0.571738 -2.310281

### Remove columns from dataframe

In [57]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.385759  0.058497  1.615827  0.277606
B  1.064094 -0.926511  0.643883  0.841569
C  0.949747  0.311666  1.140044  0.417133
D  0.060274  0.457144 -0.680493 -2.104358
E -1.151623 -1.158658 -0.161199 -0.571738

In [58]:
df

          W         X         Y         Z       new
A -0.385759  0.058497  1.615827  0.277606 -0.327261
B  1.064094 -0.926511  0.643883  0.841569  0.137583
C  0.949747  0.311666  1.140044  0.417133  1.261413
D  0.060274  0.457144 -0.680493 -2.104358  0.517419
E -1.151623 -1.158658 -0.161199 -0.571738 -2.310281

In [26]:
df.drop('new',axis=1,inplace=True)

In [27]:
df

          W         X         Y         Z
A -0.221783 -0.611199 -1.107792  1.014923
B  1.083242 -1.003654 -0.973797  1.218478
C -1.934791 -0.759670 -0.112303  0.158727
D  0.013964  0.292536 -0.063669  0.119768
E -1.322612  1.317121 -0.779869 -0.674682

In [28]:
df['new'] = df['W'] + df['X']

In [29]:
df

          W         X         Y         Z       new
A -0.221783 -0.611199 -1.107792  1.014923 -0.832983
B  1.083242 -1.003654 -0.973797  1.218478  0.079588
C -1.934791 -0.759670 -0.112303  0.158727 -2.694461
D  0.013964  0.292536 -0.063669  0.119768  0.306500
E -1.322612  1.317121 -0.779869 -0.674682 -0.005490

In [30]:
df = df.drop('new',axis=1)

In [31]:
df

          W         X         Y         Z
A -0.221783 -0.611199 -1.107792  1.014923
B  1.083242 -1.003654 -0.973797  1.218478
C -1.934791 -0.759670 -0.112303  0.158727
D  0.013964  0.292536 -0.063669  0.119768
E -1.322612  1.317121 -0.779869 -0.674682

In [32]:
df.drop('E')

          W         X         Y         Z
A -0.221783 -0.611199 -1.107792  1.014923
B  1.083242 -1.003654 -0.973797  1.218478
C -1.934791 -0.759670 -0.112303  0.158727
D  0.013964  0.292536 -0.063669  0.119768

### Selecting Rows

In [60]:
df

          W         X         Y         Z       new
A -0.385759  0.058497  1.615827  0.277606 -0.327261
B  1.064094 -0.926511  0.643883  0.841569  0.137583
C  0.949747  0.311666  1.140044  0.417133  1.261413
D  0.060274  0.457144 -0.680493 -2.104358  0.517419
E -1.151623 -1.158658 -0.161199 -0.571738 -2.310281

In [62]:
df.loc['A'] # If we need to select by index name then use 'loc'

W     -0.385759
X      0.058497
Y      1.615827
Z      0.277606
new   -0.327261
Name: A, dtype: float64

In [63]:
df.iloc[0] # If we need to select by number then use 'iloc'

W     -0.385759
X      0.058497
Y      1.615827
Z      0.277606
new   -0.327261
Name: A, dtype: float64

### Slicing dataframe

In [64]:
df[['W','X']]

          W         X
A -0.385759  0.058497
B  1.064094 -0.926511
C  0.949747  0.311666
D  0.060274  0.457144
E -1.151623 -1.158658

In [68]:
df.loc['B','X']

-0.9265109940373518

In [67]:
df

          W         X         Y         Z       new
A -0.385759  0.058497  1.615827  0.277606 -0.327261
B  1.064094 -0.926511  0.643883  0.841569  0.137583
C  0.949747  0.311666  1.140044  0.417133  1.261413
D  0.060274  0.457144 -0.680493 -2.104358  0.517419
E -1.151623 -1.158658 -0.161199 -0.571738 -2.310281

In [38]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.221783 -1.107792
B  1.083242 -0.973797

## Conditional Selection
## Multi Index and index hierarchy

In [70]:
outer_index = 'Europe Europe Europe Asia Asia Asia'.split()
inner_index = 'Greenland Norway Belgium India Japan SouthKorea'.split()

['Greenland', 'Norway', 'Belgium', 'India', 'Japan', 'SouthKorea']

In [81]:
hier_index = list(zip(outer_index,inner_index))
print(hier_index)

[('Europe', 'Greenland'), ('Europe', 'Norway'), ('Europe', 'Belgium'), ('Asia', 'India'), ('Asia', 'Japan'), ('Asia', 'SouthKorea')]

In [82]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('Europe',  'Greenland'),
            ('Europe',     'Norway'),
            ('Europe',    'Belgium'),
            (  'Asia',      'India'),
            (  'Asia',      'Japan'),
            (  'Asia', 'SouthKorea')],
           )

In [72]:
hier_index

MultiIndex([('Europe',  'Greenland'),
            ('Europe',     'Norway'),
            ('Europe',    'Belgium'),
            (  'Asia',      'India'),
            (  'Asia',      'Japan'),
            (  'Asia', 'SouthKorea')],
           )

In [79]:
df = pd.DataFrame(
                  np.random.randn(6,2),
                  index = hier_index,
                  columns = 'A B'.split()
                 )

In [74]:
df

                          A         B
Europe Greenland  -0.947042 -0.292788
       Norway     -0.194286 -1.137736
       Belgium    -0.481980  0.116347
Asia   India      -1.871757  0.904881
       Japan      -0.578227 -1.802122
       SouthKorea  0.069395 -0.286047

In [76]:
df.loc['Europe']

                  A         B
Greenland -0.947042 -0.292788
Norway    -0.194286 -1.137736
Belgium   -0.481980  0.116347

In [78]:
df.loc['Europe'].loc['Greenland']

A   -0.947042
B   -0.292788
Name: Greenland, dtype: float64

## Missing Data

In [83]:
dic = {'A':[1,2,np.nan],
       'B':[5,np.nan,np.nan],
       'C':[10,20,30]}

df = pd.DataFrame(dic)

In [84]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30

## Two main strategies to handle missing values

* **Drop**
    * Drop Row
    * Drop Column

* **Impute**
    
    * Impute by mean
    * Other complex imputation strategies - not covered right now, will cover in feature engineering lesson

In [85]:
df.dropna()

     A    B   C
0  1.0  5.0  10

In [87]:
df.dropna(axis=1)

    C
0  10
1  20
2  30

In [88]:
df.dropna(thresh=2)

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20

#### Imputation

In [89]:
df.fillna(value='FILL NULL VALUES')

                  A                 B   C
0                 1                 5  10
1                 2  FILL NULL VALUES  20
2  FILL NULL VALUES  FILL NULL VALUES  30

In [90]:
df.fillna(value=df['A'].mean())

     A    B   C
0  1.0  5.0  10
1  2.0  1.5  20
2  1.5  1.5  30

In [93]:
df['A'].fillna(value=df['A'].mean(),inplace=True)
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  1.5  NaN  30

## H/W  # how to replace with the mean of the respective column where the NA is?

# GroupBy

Groupby is a method which allows us to group rows of data together and apply aggregate functions to it.

In [111]:
data = {'Company':['GOOG','MSFT','ORCL','AMEX','FB','FB','AMEX','ORCL','GOOG','MSFT'],
        'Person':['Anusha','Shashank','Santosh','Prakash','Harish','Vipul','Joydeep','Chinmay','Fahad','Arnaud'],
        'Sales':[100,300,232,542,6534,1223,7653,9230,728,999]}

data

{'Company': ['GOOG',
  'MSFT',
  'ORCL',
  'AMEX',
  'FB',
  'FB',
  'AMEX',
  'ORCL',
  'GOOG',
  'MSFT'],
 'Person': ['Anusha',
  'Shashank',
  'Santosh',
  'Prakash',
  'Harish',
  'Vipul',
  'Joydeep',
  'Chinmay',
  'Fahad',
  'Arnaud'],
 'Sales': [100, 300, 232, 542, 6534, 1223, 7653, 9230, 728, 999]}

In [112]:
df = pd.DataFrame(data)

In [114]:
df

  Company    Person  Sales
0    GOOG    Anusha    100
1    MSFT  Shashank    300
2    ORCL   Santosh    232
3    AMEX   Prakash    542
4      FB    Harish   6534
5      FB     Vipul   1223
6    AMEX   Joydeep   7653
7    ORCL   Chinmay   9230
8    GOOG     Fahad    728
9    MSFT    Arnaud    999

In [115]:
df.groupby('Company')

In [116]:
df.groupby('Company').sum()

         Sales
Company
AMEX      8195
FB        7757
GOOG       828
MSFT      1299
ORCL      9462

In [117]:
byCompany = df.groupby('Company')

In [118]:
byCompany.std()

               Sales
Company
AMEX     5028.236321
FB       3755.444115
GOOG      444.063059
MSFT      494.267640
ORCL     6362.546817

In [108]:
byCompany.max()

           Person  Sales
Company
AMEX      Prakash   7653
FB          Vipul   6534
GOOG        Fahad    728
MSFT     Shashank    300
ORCL      Santosh   9230

## Operations on a DataFrame

In [119]:
dicti = {'col1':[1,2,3,4],'col2':[444,444,777,999],'col3':['abc','def','ghi','jkl']}

df = pd.DataFrame(dicti)

In [120]:
df

   col1  col2 col3
0     1   444  abc
1     2   444  def
2     3   777  ghi
3     4   999  jkl

## Unique values

In [121]:
df['col2'].unique()

array([444, 777, 999])

In [123]:
df['col2'].nunique()

3

In [124]:
df['col2'].value_counts()

444    2
999    1
777    1
Name: col2, dtype: int64

## Selecting data

In [125]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   777  ghi
3     4   999  jkl

In [129]:
df[(df['col1'] <= 2) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
1     2   444  def

## Applying functions

In [130]:
def times2(x):
    return x * 2

In [131]:
df['col2'].apply(times2)

0     888
1     888
2    1554
3    1998
Name: col2, dtype: int64

In [132]:
df['2_times_col2'] = df['col2'].apply(times2)
df

   col1  col2 col3  2_times_col2
0     1   444  abc           888
1     2   444  def           888
2     3   777  ghi          1554
3     4   999  jkl          1998

In [133]:
df['col2'].sum()

2664

In [134]:
df.sum()

col1                      10
col2                    2664
col3            abcdefghijkl
2_times_col2            5328
dtype: object

In [136]:
df.sum(axis=1)

0    1333
1    1334
2    2334
3    3001
dtype: int64

### See names of columns

In [139]:
df.columns#.values

Index(['col1', 'col2', 'col3', '2_times_col2'], dtype='object')

### Sorting columns

In [141]:
df.sort_values(by='col2',ascending=False)

   col1  col2 col3  2_times_col2
3     4   999  jkl          1998
2     3   777  ghi          1554
0     1   444  abc           888
1     2   444  def           888

### Finding Null values

In [153]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False   True
4   True   True  False

In [143]:
df.isnull().sum()

col1            0
col2            0
col3            0
2_times_col2    0
dtype: int64

In [144]:
import numpy as np

In [149]:
dicti = {'col1':[1,2,3,4,np.nan],'col2':[444,np.nan,777,999,np.nan],'col3':['abc','def','ghi',np.nan,'jkl']}

df = pd.DataFrame(dicti)

In [150]:
df

   col1   col2 col3
0   1.0  444.0  abc
1   2.0    NaN  def
2   3.0  777.0  ghi
3   4.0  999.0  NaN
4   NaN    NaN  jkl

In [151]:
df.isnull().sum()

col1    1
col2    2
col3    1
dtype: int64

### Create Pivot Table

In [155]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [156]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [161]:
df.pivot_table(values='D',index=['A'],columns='C',aggfunc='sum')

C    x  y
A
bar  4  6
foo  3  3

In [162]:
df.pivot_table(values='D',index=['A'],columns=['C','B'],aggfunc='sum')

C      x         y
B    one  two  one  two
A
bar  4.0  NaN  1.0  5.0
foo  1.0  2.0  3.0  NaN

## Data input and output

## Create Dataframe using csv

In [172]:
df = pd.read_csv('data/example.csv',index_col=0)

In [173]:
df

   a  b   c
0  0  4   8
1  1  5   9
2  2  6  10
3  3  7  11

In [174]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [175]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [176]:
df.to_csv('data/dict_2_csv.csv')

In [179]:
cat data/dict_2_csv.csv

,A,B,C,D
0,foo,one,x,1
1,foo,one,y,3
2,foo,two,x,2
3,bar,two,y,5
4,bar,one,x,4
5,bar,one,y,1

## Reading from and writing to excel

In [181]:
df = pd.read_excel('data/Excel_Sample.xlsx',index_col=0)
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [182]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

df.to_excel('data/dict_to_excel.xlsx')

In [184]:
ls data

911.csv*             df1*                 dict_to_excel.xlsx
Ecommerce Purchases* df2*                 dump.csv
Excel_Sample.xlsx*   df3*                 dumpdata.xlsx
Salaries.csv*        dict_2_csv.csv       example.csv

## Read from HTML file directly using pandas

In [185]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [193]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

# Great Job!